In [1]:
import pandas as pd
import numpy as np

In [21]:
titanic_df = pd.read_csv('titanic.csv',sep=',')
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,"1,0,3,""Braund, Mr. Owen Harris"",male,22,1,0,A/...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,"2,1,1,""Cumings, Mrs. John Bradley (Florence Br...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,"3,1,3,""Heikkinen, Miss. Laina"",female,26,0,0,S...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,"4,1,1,""Futrelle, Mrs. Jacques Heath (Lily May ...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,"5,0,3,""Allen, Mr. William Henry"",male,35,0,0,3...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
886,"887,0,2,""Montvila, Rev. Juozas"",male,27,0,0,21...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
887,"888,1,1,""Graham, Miss. Margaret Edith"",female,...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
888,"889,0,3,""Johnston, Miss. Catherine Helen """"Car...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
889,"890,1,1,""Behr, Mr. Karl Howell"",male,26,0,0,11...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
890,"891,0,3,""Dooley, Mr. Patrick"",male,32,0,0,3703...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
titanic_df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
"1,0,3,""Braund, Mr. Owen Harris"",male,22,1,0,A/5 21171,7.25,,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"2,1,1,""Cumings, Mrs. John Bradley (Florence Briggs Thayer)"",female,38,1,0,PC 17599,71.2833,C85,C",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"3,1,3,""Heikkinen, Miss. Laina"",female,26,0,0,STON/O2. 3101282,7.925,,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"4,1,1,""Futrelle, Mrs. Jacques Heath (Lily May Peel)"",female,35,1,0,113803,53.1,C123,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"5,0,3,""Allen, Mr. William Henry"",male,35,0,0,373450,8.05,,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
# el with permite que el archvio abierto se cierre automaticamente luego de terminado el comando
with open('titanic.csv','r') as archivo_2:
    pass

In [58]:
archivo = open('titanic.csv','r')

# lista de cada linea del archivo
listado = []
for linea in archivo.readlines():
    linea = linea.replace('"','')
    listado.append(linea)

# lista con split de las comas
arreglo = []
for i in listado:
    x = i.split(',')
    arreglo.append(x)

# los nombres de las columnas
for p in arreglo[0]:
    print(p)


PassengerId = []
Survived = []
Pclass = []
Name = []
Sex = []
Age = []
SibSp = []
Parch = []
Ticket = []
Fare = []
Cabin = []
Embarked = []

for t in arreglo:
    PassengerId.append(t[0])
    Survived.append(t[1])
    Pclass.append(t[2])
    Name.append(t[3])
    Sex.append(t[4])
    Age.append(t[5])
    SibSp.append(t[6])
    Parch.append(t[7])
    Ticket.append(t[8])
    Fare.append(t[9])
    Cabin.append(t[10])
    Embarked.append(t[11])

diccionaro = {
    'PassengerId':PassengerId[1:],
    'Survived':Survived[1:],
    'Pclass':Pclass[1:],
    'Name':Name[1:],
    'Sex':Sex[1:],
    'Age':Age[1:],
    'SibSp':SibSp[1:],
    'Parch':Parch[1:],
    'Ticket':Ticket[1:],
    'Fare':Fare[1:],
    'Cabin':Cabin[1:],
    'Embarked':Embarked[1:]
    }

df_ok = pd.DataFrame(diccionaro)
df_ok

PassengerId
Survived
Pclass
Name
Sex
Age
SibSp
Parch
Ticket
Fare
Cabin
Embarked

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,Braund,Mr. Owen Harris,male,22,1,0,A/5 21171,7.25,
1,2,1,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),female,38,1,0,PC 17599,71.2833,C85
2,3,1,3,Heikkinen,Miss. Laina,female,26,0,0,STON/O2. 3101282,7.925,
3,4,1,1,Futrelle,Mrs. Jacques Heath (Lily May Peel),female,35,1,0,113803,53.1,C123
4,5,0,3,Allen,Mr. William Henry,male,35,0,0,373450,8.05,
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,Montvila,Rev. Juozas,male,27,0,0,211536,13,
887,888,1,1,Graham,Miss. Margaret Edith,female,19,0,0,112053,30,B42
888,889,0,3,Johnston,Miss. Catherine Helen Carrie,female,,1,2,W./C. 6607,23.45,
889,890,1,1,Behr,Mr. Karl Howell,male,26,0,0,111369,30,C148
890,891,0,3,Dooley,Mr. Patrick,male,32,0,0,370376,7.75,

In [6]:
# crear dataframe con 3 columnas y 20 filas con valores aleatorios y NaN distribuidos de forma aleatoria
df = pd.DataFrame(np.random.randn(20,3),columns = ['A','B','C'])
df.iloc[2:5,1] = np.nan
df.iloc[5:8,2] = np.nan
df.iloc[8:11,0] = np.nan
df.iloc[11:14,1] = np.nan

# para reemplazar los valores nan
df2 = df.copy() #para copiar un dataframe se debe usar el metodo copy()
df[df.isna()==True] = 'x'
df

           A         B         C
0   0.005135  0.360511 -0.124776
1   0.847431  0.039414  0.622354
2   1.936931         x  0.911475
3  -1.718112         x -0.718628
4  -0.753937         x -0.437007
5  -0.837651 -0.304389         x
6   0.715918  0.175575         x
7  -1.000114  0.512222         x
8          x -0.029538  0.721462
9          x -1.532907  1.274194
10         x  1.742008 -1.804588
11  -0.20816         x -1.390771
12 -0.998567         x  0.265602
13  0.489601         x -0.769014
14  0.029214  0.532015 -0.736706
15 -0.928959  0.180225  0.209805
16  -0.14422  -0.87159  1.448506
17 -2.376607 -1.818128   0.73554
18  0.820065  -1.66158 -0.901805
19   1.14157  0.401787  0.471828

In [7]:
df2.A.dropna()

0     0.005135
1     0.847431
2     1.936931
3    -1.718112
4    -0.753937
5    -0.837651
6     0.715918
7    -1.000114
11   -0.208160
12   -0.998567
13    0.489601
14    0.029214
15   -0.928959
16   -0.144220
17   -2.376607
18    0.820065
19    1.141570
Name: A, dtype: float64

In [8]:
titanic_df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
"1,0,3,""Braund, Mr. Owen Harris"",male,22,1,0,A/5 21171,7.25,,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"2,1,1,""Cumings, Mrs. John Bradley (Florence Briggs Thayer)"",female,38,1,0,PC 17599,71.2833,C85,C",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"3,1,3,""Heikkinen, Miss. Laina"",female,26,0,0,STON/O2. 3101282,7.925,,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"4,1,1,""Futrelle, Mrs. Jacques Heath (Lily May Peel)"",female,35,1,0,113803,53.1,C123,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"5,0,3,""Allen, Mr. William Henry"",male,35,0,0,373450,8.05,,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

#b)

In [9]:
titanic_df.shape # dimensiones del dataframe

(891, 11)

In [59]:
titanic_df.size # cantidad de elementos del dataframe

10692

In [11]:
titanic_df.columns # nombre de las columnas

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [12]:
titanic_df.index # nombre de las filas

Index(['1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,,S',
       '2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38,1,0,PC 17599,71.2833,C85,C',
       '3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,,S',
       '4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,C123,S',
       '5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.05,,S',
       '6,0,3,"Moran, Mr. James",male,,0,0,330877,8.4583,,Q',
       '7,0,1,"McCarthy, Mr. Timothy J",male,54,0,0,17463,51.8625,E46,S',
       '8,0,3,"Palsson, Master. Gosta Leonard",male,2,3,1,349909,21.075,,S',
       '9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27,0,2,347742,11.1333,,S',
       '10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14,1,0,237736,30.0708,,C',
       ...
       '882,0,3,"Markun, Mr. Johann",male,33,0,0,349257,7.8958,,S',
       '883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22,0,0,7552,10.5167,,S',
       '884,0,2,"Banfield, Mr. Frederick James",male,28,0,0,C.A./SOTON 34068,10.5,,S',
       '885,0,3,"Sutehall, Mr. Henry Jr",male,25,0,0,SOTON/OQ 392076,7.05,,S',
       '886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39,0,5,382652,29.125,,Q',
       '887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13,,S',
       '888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30,B42,S',
       '889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,,1,2,W./C. 6607,23.45,,S',
       '890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30,C148,C',
       '891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.75,,Q'],
      dtype='object', name='PassengerId', length=891)

In [13]:
titanic_df.dtypes # tipo de datos de cada columna

Survived    float64
Pclass      float64
Name        float64
Sex         float64
Age         float64
SibSp       float64
Parch       float64
Ticket      float64
Fare        float64
Cabin       float64
Embarked    float64
dtype: object

In [14]:
titanic_df.head(10) # muestra las primeras 10 filas

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
"1,0,3,""Braund, Mr. Owen Harris"",male,22,1,0,A/5 21171,7.25,,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"2,1,1,""Cumings, Mrs. John Bradley (Florence Briggs Thayer)"",female,38,1,0,PC 17599,71.2833,C85,C",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"3,1,3,""Heikkinen, Miss. Laina"",female,26,0,0,STON/O2. 3101282,7.925,,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"4,1,1,""Futrelle, Mrs. Jacques Heath (Lily May Peel)"",female,35,1,0,113803,53.1,C123,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"5,0,3,""Allen, Mr. William Henry"",male,35,0,0,373450,8.05,,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"6,0,3,""Moran, Mr. James"",male,,0,0,330877,8.4583,,Q",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"7,0,1,""McCarthy, Mr. Timothy J"",male,54,0,0,17463,51.8625,E46,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"8,0,3,""Palsson, Master. Gosta Leonard"",male,2,3,1,349909,21.075,,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"9,1,3,""Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)"",female,27,0,2,347742,11.1333,,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"10,1,2,""Nasser, Mrs. Nicholas (Adele Achem)"",female,14,1,0,237736,30.0708,,C",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [15]:
titanic_df.tail(10) # muestra las ultimas 10 filas

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
"882,0,3,""Markun, Mr. Johann"",male,33,0,0,349257,7.8958,,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"883,0,3,""Dahlberg, Miss. Gerda Ulrika"",female,22,0,0,7552,10.5167,,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"884,0,2,""Banfield, Mr. Frederick James"",male,28,0,0,C.A./SOTON 34068,10.5,,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"885,0,3,""Sutehall, Mr. Henry Jr"",male,25,0,0,SOTON/OQ 392076,7.05,,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"886,0,3,""Rice, Mrs. William (Margaret Norton)"",female,39,0,5,382652,29.125,,Q",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"887,0,2,""Montvila, Rev. Juozas"",male,27,0,0,211536,13,,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"888,1,1,""Graham, Miss. Margaret Edith"",female,19,0,0,112053,30,B42,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"889,0,3,""Johnston, Miss. Catherine Helen """"Carrie"""""",female,,1,2,W./C. 6607,23.45,,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"890,1,1,""Behr, Mr. Karl Howell"",male,26,0,0,111369,30,C148,C",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"891,0,3,""Dooley, Mr. Patrick"",male,32,0,0,370376,7.75,,Q",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

#c)

In [17]:
# filtrar dataframe con PassengerId = 148
titanic_df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
"1,0,3,""Braund, Mr. Owen Harris"",male,22,1,0,A/5 21171,7.25,,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"2,1,1,""Cumings, Mrs. John Bradley (Florence Briggs Thayer)"",female,38,1,0,PC 17599,71.2833,C85,C",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"3,1,3,""Heikkinen, Miss. Laina"",female,26,0,0,STON/O2. 3101282,7.925,,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"4,1,1,""Futrelle, Mrs. Jacques Heath (Lily May Peel)"",female,35,1,0,113803,53.1,C123,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"5,0,3,""Allen, Mr. William Henry"",male,35,0,0,373450,8.05,,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
"887,0,2,""Montvila, Rev. Juozas"",male,27,0,0,211536,13,,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"888,1,1,""Graham, Miss. Margaret Edith"",female,19,0,0,112053,30,B42,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"889,0,3,""Johnston, Miss. Catherine Helen """"Carrie"""""",female,,1,2,W./C. 6607,23.45,,S",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"890,1,1,""Behr, Mr. Karl Howell"",male,26,0,0,111369,30,C148,C",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"891,0,3,""Dooley, Mr. Patrick"",male,32,0,0,370376,7.75,,Q",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN